In [1]:
import sqlite3
import pandas as pd

# Load the CSV into a DataFrame
df = pd.read_csv('used_car_price.csv')

#We will sqlite3 library and create a connection
conn = sqlite3.connect("sql_db.db")

# Write the DataFrame to the SQLite database as a table
df.to_sql('cars', conn, index=False, if_exists='replace')

#Load the sql module to ipython
%load_ext sql

#Load local dataset
%sql sqlite:///sql_db.db

## SQL Aggregate Function
An aggregate function is a function that performs a calculation on a set of values, and returns a single value.
The most commonly used SQL aggregate functions are:
- MIN() - returns the smallest value within the selected column
- MAX() - returns the largest value within the selected column
- COUNT() - returns the number of rows in a set
- SUM() - returns the total sum of a numerical column
- AVG() - returns the average value of a numerical column

In [2]:
%%sql
-- MIN()

select min(model_year) from cars;

 * sqlite:///sql_db.db
Done.

[(1974,)]

In [3]:
%%sql
-- MAX()

select max(milage) from cars;

 * sqlite:///sql_db.db
Done.

[(405000,)]

In [4]:
%%sql
-- MAX() with condition

select max(milage) from cars where model_year=2024;

 * sqlite:///sql_db.db
Done.

[(89988,)]

In [5]:
%%sql
-- Use Group by
select fuel_type, max(price) as maximum_price from cars group by fuel_type;

 * sqlite:///sql_db.db
Done.

[(None, 2954083),
 ('Diesel', 2954083),
 ('E85 Flex Fuel', 2954083),
 ('Gasoline', 2954083),
 ('Hybrid', 1599000),
 ('Plug-In Hybrid', 399950),
 ('not supported', 60000),
 ('–', 2954083)]

In [6]:
%%sql
-- using group by to count

select fuel_type, count(*) as total_numbers from cars group by fuel_type;

 * sqlite:///sql_db.db
Done.

[(None, 5083),
 ('Diesel', 3955),
 ('E85 Flex Fuel', 5406),
 ('Gasoline', 165940),
 ('Hybrid', 6832),
 ('Plug-In Hybrid', 521),
 ('not supported', 15),
 ('–', 781)]

In [7]:
%%sql
-- Count the luxury cars with brands

select brand, count(*) from cars where price > 2000000 group by brand;

 * sqlite:///sql_db.db
Done.

[('Aston', 1),
 ('Audi', 1),
 ('Bentley', 1),
 ('Cadillac', 4),
 ('Chevrolet', 4),
 ('Chrysler', 1),
 ('Dodge', 1),
 ('Ford', 9),
 ('GMC', 1),
 ('Honda', 1),
 ('Hyundai', 1),
 ('INFINITI', 1),
 ('Land', 5),
 ('Lexus', 4),
 ('Mercedes-Benz', 6),
 ('Pontiac', 1),
 ('RAM', 5),
 ('Tesla', 1),
 ('Toyota', 2)]

In [8]:
%%sql
-- sum()

select sum(price) as total_used_car_price from cars;

 * sqlite:///sql_db.db
Done.

[(8272454024,)]

In [9]:
%%sql
-- Hybrid car price

select sum(price) as total_hybrid_car_price from cars where fuel_type='Hybrid'

 * sqlite:///sql_db.db
Done.

[(378994622,)]

In [10]:
%%sql

select fuel_type, avg(price) as average_car_price from cars 
group by fuel_type
order by average_car_price desc;

 * sqlite:///sql_db.db
Done.

[(None, 60822.612040133776),
 ('Hybrid', 55473.45169789227),
 ('Diesel', 48769.587357774966),
 ('Plug-In Hybrid', 44150.96737044146),
 ('Gasoline', 43360.01378208991),
 ('–', 36414.28553137004),
 ('E85 Flex Fuel', 26729.75545689974),
 ('not supported', 20692.733333333334)]

In [11]:
%%sql
-- average price

select avg(price) from cars;

 * sqlite:///sql_db.db
Done.

[(43878.01617753921,)]